<a href="https://colab.research.google.com/github/RudinP/SOLUX_Summer_data_study/blob/master/2%EC%A3%BC%EC%B0%A8/%EC%B1%95%ED%84%B010(0801).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
school_id_list=[{'name':'John','job':'teacher','age':40},
             {'name':'Nate','job':'teacher','age':35},
             {'name':'Yuna','job':'teacher','age':37},
             {'name':'Abraham','job':'student','age':10},
             {'name':'Brian','job':'teacher','age':12},
             {'name':'Janny','job':'teacher','age':11},
             {'name':'Nate','job':'teacher','age':None},
             {'name':'John','job':'student','age':None},]
df=pd.DataFrame(school_id_list, columns=['name','job','age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  teacher  12.0
5    Janny  teacher  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [ ]:
df.shape#row의 개수, column의 개수

(8, 3)

In [ ]:
df.info()#DataFrame의 인포메이션

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 192.0+ bytes

In [ ]:
df.isna()#none값 확인

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [ ]:
df.isnull()#또 다른 none값 확인 함수

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [ ]:
df.age=df.age.fillna(0)#df에 있는 age 컬럼에서 null값을 발견하면 0으로 바꾸라는 의미

In [ ]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  teacher  12.0
5    Janny  teacher  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [ ]:
school_id_list=[{'name':'John','job':'teacher','age':40},
             {'name':'Nate','job':'teacher','age':35},
             {'name':'Yuna','job':'teacher','age':37},
             {'name':'Abraham','job':'student','age':10},
             {'name':'Brian','job':'teacher','age':12},
             {'name':'Janny','job':'teacher','age':11},
             {'name':'Nate','job':'teacher','age':None},
             {'name':'John','job':'student','age':None},]
df=pd.DataFrame(school_id_list, columns=['name','job','age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  teacher  12.0
5    Janny  teacher  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [ ]:
df['age'].fillna(df.groupby('job')['age'].transform('median'),inplace=True)#job을 기준으로 해당하는 그룹에서의 median 값으로 age의 Nan을 채운다, 바로 변경된 점이 적용되도록 inplace 사용

In [ ]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  teacher  12.0
5    Janny  teacher  11.0
6     Nate  teacher  35.0
7     John  student  10.0

In [ ]:
#여기서 나는 Janny를 강의와 다르게, teacher 로 해두었기 때문에 강의의 median값과 다르게 적용되었다.